#include <sys/types.h>
#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>

int main() {
    // Дескриптор для pipe
    int fd[2];

    // Размер записанного сообщения
    int size;
    // Байт который мы будем добавлять
    char *b =  malloc(1 * sizeof(char));
    // Количество записанных байт
    int res;

    // Создаем pipe и проверяем, что все хорошо
    if (pipe(fd) < 0) {
        printf("Can\'t open pipe\n");
        exit(-1);
    }

    
    // Записываем сообщение, прибавляя по одному байту на кажлой иттерации
    // Останавливаемся, когда не можем записать байт - предел достигнут
    do {
        size = write(fd[1], b, 1);
        res++;
        printf("%d\n", res);
    } while (size == 1);

    // Функция write блокируется, когда мы достигаем предела
    // Поэтому до этого момента код не дойдет никогда
    // Нв локальной машине код выдает последний резлуьтат 65536 байт
    // На удаленном сервере - 4 261 296 байт

    res--;

    // Выводим итог
    printf("Pipe size is [%d bytes]\n", res);

    return 0;
}
